Ran Plan for project: `k8s-dev` dir: `k8s` workspace: `filecoin-dev-apn1-glif-eks`

<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/tls from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of louy/uptimerobot from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Using previously-installed hashicorp/random v3.4.3
- Using previously-installed hashicorp/kubernetes v2.13.1
- Using previously-installed hashicorp/helm v2.6.0
- Using previously-installed hashicorp/tls v4.0.2
- Using previously-installed hashicorp/local v2.2.3
- Using previously-installed louy/uptimerobot v0.5.1
- Using previously-installed hashicorp/aws v4.33.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "filecoin-dev-apn1-glif-eks".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lb.kong_external will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lb" "kong_external" {
      + access_logs                = (known after apply)
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + customer_owned_ipv4_pool   = (known after apply)
      + desync_mitigation_mode     = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = (known after apply)
      + enable_deletion_protection = (known after apply)
      + enable_http2               = (known after apply)
      + enable_waf_fail_open       = (known after apply)
      + id                         = (known after apply)
      + idle_timeout               = (known after apply)
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = (known after apply)
      + name                       = (known after apply)
      + preserve_host_header       = (known after apply)
      + security_groups            = (known after apply)
      + subnet_mapping             = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name" = "filecoin-dev-apn1-glif-kong-external"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # aws_api_gateway_account.account_logging_dev[0] will be updated in-place
~ resource "aws_api_gateway_account" "account_logging_dev" {
      ~ cloudwatch_role_arn = "arn:aws:iam::499623857295:role/filecoin-mainnet-apn1-glif-apigw-logging" -> "arn:aws:iam::499623857295:role/filecoin-dev-apn1-glif-apigw-logging"
        id                  = "api-gateway-account"
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.api_dev_node_glif_io[0] will be updated in-place
~ resource "aws_route53_record" "api_dev_node_glif_io" {
        id              = "Z09410602UCRWJDOQ7CH7_api.dev.node.glif.io_A"
        name            = "api.dev.node.glif.io"
      ~ records         = [] -> (known after apply)
      ~ ttl             = 0 -> 60
      ~ type            = "A" -> "CNAME"
        # (3 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "d-wkv5mspqx5.execute-api.ap-northeast-1.amazonaws.com" -> null
          - zone_id                = "Z1YSHQZHG15GKL" -> null
        }
    }

  # aws_route53_record.monitoring[0] will be updated in-place
~ resource "aws_route53_record" "monitoring" {
        id              = "Z09410602UCRWJDOQ7CH7_monitoring.dev.node.glif.io_CNAME"
        name            = "monitoring.dev.node.glif.io"
      ~ records         = [
          - "a026233a490f64e98a6eeadd75885a9e-20cb518f7bb56841.elb.ap-northeast-1.amazonaws.com",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # helm_release.konghq-external will be updated in-place
~ resource "helm_release" "konghq-external" {
        id                         = "filecoin-dev-apn1-glif-kong-external"
        name                       = "filecoin-dev-apn1-glif-kong-external"
      ~ version                    = "2.12.0" -> "2.13.0"
        # (27 unchanged attributes hidden)

      + set {
          + name  = "ingressController.image.tag"
          + value = "2.8"
        }
      - set {
          - name  = "ingressController.ingressClass" -> null
          - value = "kong-external-lb" -> null
        }
      + set {
          + name  = "ingressController.ingressClass"
          + value = "kong-external-lb"
        }
      - set {
          - name  = "ingressController.ingressClassAnnotations.ingressclass\\.kubernetes\\.io/is-default-class" -> null
          - value = "true" -> null
        }
      + set {
          + name  = "ingressController.ingressClassAnnotations.ingressclass\\.kubernetes\\.io/is-default-class"
          + value = "true"
        }
      - set {
          - name  = "ingressController.installCRDs" -> null
          - value = "false" -> null
        }
      + set {
          + name  = "ingressController.installCRDs"
          + value = "false"
        }
      - set {
          - name  = "proxy.annotations.prometheus\\.io/port" -> null
          - value = "10254" -> null
        }
      + set {
          + name  = "proxy.annotations.prometheus\\.io/port"
          + value = "10254"
        }
      - set {
          - name  = "proxy.annotations.prometheus\\.io/scrape" -> null
          - value = "true" -> null
        }
      + set {
          + name  = "proxy.annotations.prometheus\\.io/scrape"
          + value = "true"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-additional-resource-tags" -> null
          - value = "Name=filecoin-dev-apn1-glif-kong-external" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-additional-resource-tags"
          + value = "Name=filecoin-dev-apn1-glif-kong-external"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-backend-protocol" -> null
          - value = "https" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-backend-protocol"
          + value = "https"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-proxy-protocol" -> null
          - value = "*" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-proxy-protocol"
          + value = "*"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-cert" -> null
          - value = "arn:aws:acm:ap-northeast-1:499623857295:certificate/a875c715-7e6a-4ff2-91e3-6d0271e755c0" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-cert"
          + value = "arn:aws:acm:ap-northeast-1:499623857295:certificate/a875c715-7e6a-4ff2-91e3-6d0271e755c0"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-negotiation-policy" -> null
          - value = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-negotiation-policy"
          + value = "ELBSecurityPolicy-TLS13-1-2-2021-06"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-ports" -> null
          - value = "443" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-ports"
          + value = "443"
        }
      - set {
          - name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type" -> null
          - value = "nlb" -> null
        }
      + set {
          + name  = "proxy.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type"
          + value = "nlb"
        }
      - set {
          - name  = "proxy.stream[0].containerPort" -> null
          - value = "1235" -> null
        }
      + set {
          + name  = "proxy.stream[0].containerPort"
          + value = "1235"
        }
      - set {
          - name  = "proxy.stream[0].protocol" -> null
          - value = "TCP" -> null
        }
      + set {
          + name  = "proxy.stream[0].protocol"
          + value = "TCP"
        }
      - set {
          - name  = "proxy.stream[0].servicePort" -> null
          - value = "1235" -> null
        }
      + set {
          + name  = "proxy.stream[0].servicePort"
          + value = "1235"
        }
      - set {
          - name  = "proxy.tls.overrideServiceTargetPort" -> null
          - value = "8000" -> null
        }
      + set {
          + name  = "proxy.tls.overrideServiceTargetPort"
          + value = "8000"
        }
      - set {
          - name  = "replicaCount" -> null
          - value = "2" -> null
        }
      + set {
          + name  = "replicaCount"
          + value = "4"
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_circulating_supply will be created
+ resource "kubernetes_ingress_v1" "get_circulating_supply" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "GET"
              + "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-daemon-access, kong-apigw-dev-serverless-function-statecirculatingsupply, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-circulating-supply"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/statecirculatingsupply"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "api-read-dev-lotus-service"

                              + port {
                                  + number = 1234
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_circulating_supply_fil will be created
+ resource "kubernetes_ingress_v1" "get_circulating_supply_fil" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "GET"
              + "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-index, kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-circulating-supply-fil"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/statecirculatingsupply/fil"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-circulatingsupply"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_circulating_supply_fil_v2 will be created
+ resource "kubernetes_ingress_v1" "get_circulating_supply_fil_v2" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "GET"
              + "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-index, kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-circulating-supply-fil-v2"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/statecirculatingsupply/fil/v2"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-circulatingsupply-staging"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_diluted_supply will be created
+ resource "kubernetes_ingress_v1" "get_diluted_supply" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "GET"
              + "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-dilutedsupply, kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-dilutedsupply"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/dilutedsupply"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-circulatingsupply"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_root will be created
+ resource "kubernetes_ingress_v1" "get_root" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "GET"
              + "konghq.com/plugins"       = "kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-root"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-homepage"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_rpc_v0 will be created
+ resource "kubernetes_ingress_v1" "get_rpc_v0" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "GET"
              + "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-root, kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
              + "konghq.com/strip-path"    = "true"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-rpc-v0"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/rpc/v0"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-homepage"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_rpc_v1 will be created
+ resource "kubernetes_ingress_v1" "get_rpc_v1" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "GET"
              + "konghq.com/plugins"       = "kong-apigw-dev-request-transformer-to-root, kong-apigw-dev-response-transformer-content-type, kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
              + "konghq.com/strip-path"    = "true"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-rpc-v1"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/rpc/v1"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-homepage"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.get_vm_circulating_supply will be created
+ resource "kubernetes_ingress_v1" "get_vm_circulating_supply" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "GET"
              + "konghq.com/plugins"   = "kong-apigw-dev-serverless-function-vmcirculatingsupply, kong-apigw-dev-request-transformer-daemon-access, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-get-vm-circulating-supply"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/vmcirculatingsupply"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "api-read-dev-lotus-service"

                              + port {
                                  + number = 1234
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.options_root will be created
+ resource "kubernetes_ingress_v1" "options_root" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "OPTIONS"
              + "konghq.com/plugins"   = "kong-apigw-dev-serverless-function-mock, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-options-root"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-homepage"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.options_rpc_v0 will be created
+ resource "kubernetes_ingress_v1" "options_rpc_v0" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "OPTIONS"
              + "konghq.com/plugins"   = "kong-apigw-dev-serverless-function-mock, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-options-rpc-v0"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/rpc/v0"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-homepage"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.options_rpc_v1 will be created
+ resource "kubernetes_ingress_v1" "options_rpc_v1" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "OPTIONS"
              + "konghq.com/plugins"   = "kong-apigw-dev-serverless-function-mock, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-options-rpc-v1"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/rpc/v1"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "kong-apigw-dev-homepage"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.post_root will be created
+ resource "kubernetes_ingress_v1" "post_root" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"       = "POST"
              + "konghq.com/plugins"       = "kong-apigw-dev-serverless-function-root, kong-apigw-dev-request-transformer-public-access, kong-apigw-dev-response-transformer-content-type, kong-apigw-dev-cors"
              + "konghq.com/preserve-host" = "false"
              + "konghq.com/protocols"     = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-post-root"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "api-read-dev-lotus-service"

                              + port {
                                  + number = 2346
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.post_rpc_v0 will be created
+ resource "kubernetes_ingress_v1" "post_rpc_v0" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "POST"
              + "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-public-access, kong-apigw-dev-response-transformer-content-type, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-post-rpc-v0"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/rpc/v0"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "api-read-dev-lotus-service"

                              + port {
                                  + number = 2346
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_ingress_v1.post_rpc_v1 will be created
+ resource "kubernetes_ingress_v1" "post_rpc_v1" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "konghq.com/methods"   = "POST"
              + "konghq.com/plugins"   = "kong-apigw-dev-request-transformer-public-access, kong-apigw-dev-response-transformer-content-type, kong-apigw-dev-cors"
              + "konghq.com/protocols" = "http"
            }
          + generation       = (known after apply)
          + name             = "kong-apigw-dev-post-rpc-v1"
          + namespace        = "network"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "kong-external-lb"

          + rule {
              + host = "api.dev.node.glif.io"

              + http {
                  + path {
                      + path      = "/rpc/v1"
                      + path_type = "Exact"

                      + backend {

                          + service {
                              + name = "api-read-dev-lotus-service"

                              + port {
                                  + number = 2346
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.cors will be created
+ resource "kubernetes_manifest" "cors" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-cors"
              + namespace = "network"
            }
          + plugin     = "cors"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + headers = [
                  + "Authorization",
                  + "Accept",
                  + "Origin",
                  + "DNT",
                  + "X-CustomHeader",
                  + "Keep-Alive",
                  + "User-Agent",
                  + "X-Requested-With",
                  + "If-Modified-Since",
                  + "Cache-Control",
                  + "Content-Type",
                  + "Content-Length",
                  + "Content-Range",
                  + "Range",
                ]
              + origins = [
                  + "*",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-cors"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "cors"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-daemon_access will be created
+ resource "kubernetes_manifest" "request_transformer-daemon_access" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + (sensitive),
                    ]
                }
              + replace = {
                  + headers = [
                      + (sensitive),
                    ]
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-daemon-access"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.wvjvRpu07OZOFsMXWQsQhsUso0WaK9GYgBnKGRO7pUI",
                    ]
                }
              + replace = {
                  + headers = [
                      + "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.wvjvRpu07OZOFsMXWQsQhsUso0WaK9GYgBnKGRO7pUI",
                    ]
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-daemon-access"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-public_access will be created
+ resource "kubernetes_manifest" "request_transformer-public_access" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + (sensitive),
                    ]
                }
              + replace = {
                  + headers = [
                      + (sensitive),
                    ]
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-public-access"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.wvjvRpu07OZOFsMXWQsQhsUso0WaK9GYgBnKGRO7pUI",
                    ]
                }
              + replace = {
                  + headers = [
                      + "Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJBbGxvdyI6WyJyZWFkIiwid3JpdGUiXX0.wvjvRpu07OZOFsMXWQsQhsUso0WaK9GYgBnKGRO7pUI",
                    ]
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-public-access"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_diluted_supply will be created
+ resource "kubernetes_manifest" "request_transformer-to_diluted_supply" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + replace = {
                  + uri = "/diluted_supply.html"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-to-dilutedsupply"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + replace = {
                  + uri = "/diluted_supply.html"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-to-dilutedsupply"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_index will be created
+ resource "kubernetes_manifest" "request_transformer-to_index" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + replace = {
                  + uri = "/index.html"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-to-index"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + replace = {
                  + uri = "/index.html"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-to-index"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_root will be created
+ resource "kubernetes_manifest" "request_transformer-to_root" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + replace = {
                  + uri = "/"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-to-root"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + replace = {
                  + uri = "/"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-to-root"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_rpc_v0 will be created
+ resource "kubernetes_manifest" "request_transformer-to_rpc_v0" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add = {
                  + uri = "/rpc/v0"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-to-rpc-v0"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add = {
                  + uri = "/rpc/v0"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-to-rpc-v0"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.request_transformer-to_rpc_v1 will be created
+ resource "kubernetes_manifest" "request_transformer-to_rpc_v1" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + replace = {
                  + uri = "/rpc/v1"
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-request-transformer-to-rpc-v1"
              + namespace = "network"
            }
          + plugin     = "request-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + replace = {
                  + uri = "/rpc/v1"
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-request-transformer-to-rpc-v1"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "request-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.response_transformer-content_type will be created
+ resource "kubernetes_manifest" "response_transformer-content_type" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + add     = {
                  + headers = [
                      + "Content-Type:application/json",
                    ]
                }
              + replace = {
                  + headers = [
                      + "Content-Type:application/json",
                    ]
                }
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-response-transformer-content-type"
              + namespace = "network"
            }
          + plugin     = "response-transformer"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + add     = {
                  + headers = [
                      + "Content-Type:application/json",
                    ]
                }
              + replace = {
                  + headers = [
                      + "Content-Type:application/json",
                    ]
                }
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-response-transformer-content-type"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "response-transformer"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.serverless_function-mock will be created
+ resource "kubernetes_manifest" "serverless_function-mock" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + access = [
                  + "return kong.response.exit(200, '{\"statusCode\": 200}', {[\"Content-Type\"] = \"application/json\"})",
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-serverless-function-mock"
              + namespace = "network"
            }
          + plugin     = "post-function"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + access = [
                  + "return kong.response.exit(200, '{\"statusCode\": 200}', {[\"Content-Type\"] = \"application/json\"})",
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-serverless-function-mock"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "post-function"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.serverless_function-root will be created
+ resource "kubernetes_manifest" "serverless_function-root" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + access = [
                  + <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")
                    EOT,
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-serverless-function-root"
              + namespace = "network"
            }
          + plugin     = "post-function"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + access = [
                  + <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")
                    EOT,
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kong-apigw-dev-serverless-function-root"
              + namespace                  = "network"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + ordering    = {
              + after  = (known after apply)
              + before = (known after apply)
            }
          + plugin      = "post-function"
          + protocols   = (known after apply)
          + run_on      = (known after apply)
        }
    }

  # module.api_gateway_kong_dev[0].kubernetes_manifest.serverless_function-statecirculatingsupply will be created
+ resource "kubernetes_manifest" "serverless_function-statecirculatingsupply" {
      + manifest = {
          + apiVersion = "configuration.konghq.com/v1"
          + config     = {
              + access        = [
                  + <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateCirculatingSupply","id":42,"params":[[]]}')
                    EOT,
                ]
              + body_filter   = [
                  + <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"result":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              + header_filter = [
                  + <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          + kind       = "KongPlugin"
          + metadata   = {
              + name      = "kong-apigw-dev-serverless-function-statecirculatingsupply"
              + namespace = "network"
            }
          + plugin     = "post-function"
        }
      + object   = {
          + apiVersion  = "configuration.konghq.com/v1"
          + config      = {
              + access        = [
                  + <<-EOT
                        kong.service.request.set_method("POST")kong.service.request.set_header("Content-Type","application/json")kong.service.request.set_path("/rpc/v0")kong.service.request.set_raw_body('{"jsonrpc":"2.0","method":"Filecoin.StateCirculatingSupply","id":42,"params":[[]]}')
                    EOT,
                ]
              + body_filter   = [
                  + <<-EOT
                        if kong.response.get_status()==200 then local a=kong.response.get_raw_body()if a then local b=string.sub(a,string.find(a,'"result":"%d+"'))local c=string.sub(b,string.find(b,'%d+'))kong.response.set_raw_body(c)end end
                    EOT,
                ]
              + header_filter = [
                  + <<-EOT
                        kong.response.clear_header("Content-Length")
                    EOT,
                ]
            }
          + configFrom  = {
              + secretKeyRef = {
                  + key  = (known after apply)
                  + name = (known after apply)
                }
            }
          + consumerRef = (known after apply)
          + disabled    = (known after apply)
          + kind        = "KongPlugin"
          + metadata    = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.